zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32.c
	#ifdef XSPI_CCR_SIOO
		s_command.SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;
	#endif /* XSPI_CCR_SIOO */

	ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

	/* Initializes the program command */
	s_command.OperationType = HAL_XSPI_OPTYPE_WRITE_CFG;
	if (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE) {
		s_command.Instruction =
			(dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
				? ((mspi_stm32_hal_address_size(dev_data->ctx.xfer.addr_length) ==
				    HAL_XSPI_ADDRESS_24_BITS)
					   ? MSPI_STM32_CMD_PP
					   : MSPI_STM32_CMD_PP_4B)
				: MSPI_STM32_OCMD_PAGE_PRG;
	} else {
		s_command.Instruction = MSPI_STM32_OCMD_PAGE_PRG;
	}

	s_command.DQSMode = HAL_XSPI_DQS_DISABLE;
	ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

	#ifdef XSPI_CR_NOPREF
		s_MemMappedCfg.NoPrefetchData = HAL_XSPI_AUTOMATIC_PREFETCH_ENABLE;
	#ifdef XSPI_CR_NOPREF_AXI
		s_MemMappedCfg.NoPrefetchAXI = HAL_XSPI_AXI_PREFETCH_DISABLE;
	#endif /* XSPI_CR_NOPREF_AXI */
	#endif /* XSPI_CR_NOPREF */

	/* Enables the memory-mapping */
	s_MemMappedCfg.TimeOutActivation = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;
	ret = HAL_XSPI_MemoryMapped(&dev_data->hmspi.xspi, &s_MemMappedCfg);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to enable memory mapped mode");
		return -EIO;
	}

	return 0;
}

static inline int mspi_context_lock(struct mspi_context *ctx, const struct mspi_dev_id *req,
				    const struct mspi_xfer *xfer, bool lockon)
{
	int ret = 0;
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout))) {
		return -EBUSY;
	}

	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;
	return ret;
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static inline bool mspi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return (k_sem_count_get(&dev_data->ctx.lock) == 0);
}

/**
 * @brief Reads/Writes in memory mapped mode.
 *
 */
static int read_write_in_memory_map_mode(const struct device *dev, struct mspi_xfer_packet *packet){
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if(packet->data_buf == NULL) {
		LOG_ERR("data buf is null :%x\n", packet->cmd);
		return -EIO;
	}

	if (!stm32_xspi_is_memorymap(dev)) {
			ret = mspi_stm32_memmap_on(dev);
			if (ret != 0) {
				LOG_ERR("Failed to set memory mapped");
				return ret;
			}
	}

	uintptr_t mmap_addr = dev_data->memmap_base_addr + packet->address;

	if(packet->dir == MSPI_RX) {
		LOG_INF("Memory-mapped read from 0x%08lx, len %zu", mmap_addr, packet->num_bytes);
		memcpy(packet->data_buf, (void *)mmap_addr, packet->num_bytes);
		HAL_Delay(1);
		return 0;
	} else {
		LOG_INF("Memory-mapped write from 0x%08lx, len %zu\n", mmap_addr, packet->num_bytes);
		memcpy((void *)mmap_addr,packet->data_buf, packet->num_bytes);
		HAL_Delay(1);
		return 0;
	}
}

/**
 * @brief Sends a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode.
 *
 */
static int mspi_stm32_access(const struct device *dev, struct mspi_xfer_packet *packet,
			     uint8_t access_mode)
{
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if(dev_data->xip_cfg.enable) {
		ARG_UNUSED(access_mode);

		if((packet->cmd == MSPI_STM32_CMD_WREN) || (packet->cmd == MSPI_STM32_OCMD_WREN) ||
		   (packet->cmd == MSPI_STM32_CMD_SE_4B) ||  (packet->cmd == MSPI_STM32_CMD_SE) ||
		   (packet->cmd == MSPI_STM32_OCMD_SE) ||
		   ((mspi_stm32_hal_address_size(dev_data->dev_cfg.addr_length) == HAL_XSPI_ADDRESS_24_BITS) && (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE))){
			LOG_DBG(" MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported in memory map mode, switching to indirect mode");
			if (stm32_xspi_is_memorymap(dev)) {
				ret = mspi_stm32_memmap_off(dev);
				if (ret != 0) {
					LOG_ERR("Failed to abort memory-mapped access");
					goto e_access;
				}
			}
			goto indirect;
		}

		return read_write_in_memory_map_mode(dev, packet);
	}

indirect:
	XSPI_RegularCmdTypeDef cmd =
		mspi_stm32_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	cmd.DataLength = packet->num_bytes;
	cmd.Instruction = packet->cmd;
	if (packet->dir == MSPI_TX) {
		cmd.DummyCycles = dev_data->ctx.xfer.tx_dummy;
	} else {
		cmd.DummyCycles = dev_data->ctx.xfer.rx_dummy;
	}
	cmd.Address = packet->address; /* AddressSize is 32bits in OPSI mode */
	cmd.AddressWidth = mspi_stm32_hal_address_size(dev_data->ctx.xfer.addr_length);
	if (cmd.DataLength == 0) {
		cmd.DataMode = HAL_XSPI_DATA_NONE;
	}

	if ((cmd.Instruction == MSPI_STM32_CMD_WREN) || (cmd.Instruction == MSPI_STM32_OCMD_WREN)) {
		/* Write Enable only accepts HAL_XSPI_ADDRESS_NONE */
		cmd.AddressMode = HAL_XSPI_ADDRESS_NONE;
	}

	LOG_DBG("MSPI access Instruction 0x%x", cmd.Instruction);

	ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("%d: Failed to send XSPI instruction", ret);
		return -EIO;
	}

	if (packet->num_bytes == 0) {
		return 0;
	}

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			ret = HAL_XSPI_Receive(&dev_data->hmspi.xspi, packet->data_buf,
						   HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
			goto e_access;
		case MSPI_ACCESS_ASYNC:
			ret = HAL_XSPI_Receive_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			uint8_t *dma_buf = k_aligned_alloc(CONFIG_MSPI_BUFFER_ALIGNMENT, packet->num_bytes);
			if (!dma_buf) {
				LOG_ERR("DMA buffer allocation failed");
				return -ENOMEM;
			}

			ret = HAL_XSPI_Receive_DMA(&dev_data->hmspi.xspi, dma_buf);
			if (ret == 0) {
				if (k_sem_take(&dev_data->sync, K_FOREVER)) {
					LOG_ERR("%d: Failed to take sem", dev_data->hmspi.xspi.ErrorCode);
					k_free(dma_buf);
					return -EIO;
				}
				memcpy(packet->data_buf, dma_buf, packet->num_bytes  );
			}

			k_free(dma_buf);  
			goto e_access;
		default:
			/* Not correct */
			ret = HAL_BUSY;
			break;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			ret = HAL_XSPI_Transmit(&dev_data->hmspi.xspi, packet->data_buf,
						    HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
			goto e_access;
		case MSPI_ACCESS_ASYNC:
			ret = HAL_XSPI_Transmit_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			ret = HAL_XSPI_Transmit_DMA(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		default:
			/* Not correct */
			ret = HAL_BUSY;
			break;
		}
	}

