zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32.c
	if (ret != HAL_OK) {
		LOG_ERR("%d: Failed to access data", ret);
		return -EIO;
	}

	/* Lock again expecting the IRQ for end of Tx or Rx */
	if (k_sem_take(&dev_data->sync, K_FOREVER)) {
		LOG_ERR("%d: Failed to access data", ret);
		return -EIO;
	}

e_access:
	LOG_DBG("Access %zu data at 0x%lx", packet->num_bytes, (long)(packet->address));

	return ret;
}

/* Start Automatic-Polling mode to wait until the memory is setting mask/value bit */
static int mspi_stm32_wait_auto_polling(const struct device *dev, uint8_t match_value,
					uint8_t match_mask, uint32_t timeout_ms)
{
	struct mspi_stm32_data *dev_data = dev->data;
	XSPI_AutoPollingTypeDef s_config;

	/* Set the match to check if the bit is Reset */
	s_config.MatchValue = match_value;
	s_config.MatchMask = match_mask;

	s_config.MatchMode = HAL_XSPI_MATCH_MODE_AND;
	s_config.IntervalTime = MSPI_STM32_AUTO_POLLING_INTERVAL;
	s_config.AutomaticStop = HAL_XSPI_AUTOMATIC_STOP_ENABLE;

	if (HAL_XSPI_AutoPolling_IT(&dev_data->hmspi.xspi, &s_config) != HAL_OK) {
		LOG_ERR("XSPI AutoPoll failed");
		return -EIO;
	}

	if (k_sem_take(&dev_data->sync, K_MSEC(timeout_ms)) != 0) {
		LOG_ERR("XSPI AutoPoll wait failed");
		HAL_XSPI_Abort(&dev_data->hmspi.xspi);
		k_sem_reset(&dev_data->sync);
		return -EIO;
	}

	return 0;
}

/*
 * Reads the status reg of the device
 * Send the RDSR command (according to io_mode/data_rate)
 * Then sets the Autopolling mode with match mask/value bit.
 */
static int mspi_stm32_status_reg(const struct device *controller, const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_context *ctx = &dev_data->ctx;

	if (xfer->num_packet == 0 || !xfer->packets) {
		LOG_ERR("Status Reg.: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_context_lock(ctx, dev_data->dev_id, xfer, true);
	if (ret) {
		goto status_err;
	}

	XSPI_RegularCmdTypeDef cmd =
		mspi_stm32_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);
	if(dev_data->dev_cfg.io_mode == MSPI_IO_MODE_OCTAL){
		cmd.Instruction = MSPI_STM32_OCMD_RDSR ;
		cmd.DummyCycles = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_DUAL)?
		MSPI_STM32_DUMMY_REG_OCTAL_DTR :MSPI_STM32_DUMMY_REG_OCTAL;
	}else{
		cmd.Instruction = MSPI_STM32_CMD_RDSR;
		cmd.AddressMode = HAL_XSPI_ADDRESS_NONE;
		cmd.DataMode = HAL_XSPI_DATA_1_LINE;
		cmd.DummyCycles = 0;
		cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
	}
	cmd.Address = 0U;
	LOG_DBG("MSPI poll status reg.");

	XSPI_AutoPollingTypeDef s_config;

	/* Set the match to check if the bit is Reset */
	s_config.MatchValue = MSPI_STM32_WEL_MATCH;
	s_config.MatchMask = MSPI_STM32_WEL_MASK;

	s_config.MatchMode = HAL_XSPI_MATCH_MODE_AND;
	s_config.IntervalTime = MSPI_STM32_AUTO_POLLING_INTERVAL;
	s_config.AutomaticStop = HAL_XSPI_AUTOMATIC_STOP_ENABLE;

	if (stm32_xspi_is_memorymap(controller)) {
		ret = mspi_stm32_memmap_off(controller);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped access before sending status command");
		return  -1;
		}
	}

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE)) {
		LOG_ERR("%d: Failed to send XSPI instruction", ret);
		ret = -EIO;
		goto status_err;
	}

	ret = mspi_stm32_wait_auto_polling(controller,
		MSPI_STM32_MEM_RDY_MATCH,
		MSPI_STM32_MEM_RDY_MASK,
		HAL_XSPI_TIMEOUT_DEFAULT_VALUE);

status_err:
	k_sem_give(&ctx->lock);
	return ret;
}

/*
 * Polls the WIP(Write In Progress) bit to become to 0
 * in cfg_mode SPI/OPI MSPI_IO_MODE_SINGLE or MSPI_IO_MODE_OCTAL
 * and cfg_rate transfer STR/DTR MSPI_DATA_RATE_SINGLE or MSPI_DATA_RATE_DUAL
 */
static int mspi_stm32_mem_ready(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;

	XSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);

	/* Configure automatic polling mode command to wait for memory ready */
	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_RDSR;
		s_command.DummyCycles = (cfg_rate == MSPI_DATA_RATE_DUAL)
						? MSPI_STM32_DUMMY_REG_OCTAL_DTR
						: MSPI_STM32_DUMMY_REG_OCTAL;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_RDSR;
		/* force 1-line InstructionMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
		/* force 1-line DataMode for any non-OSPI transfer */
		s_command.DataMode = HAL_XSPI_DATA_1_LINE;
		s_command.DummyCycles = 0;
	}
	s_command.DataLength = ((cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U);
	s_command.Address = 0U;

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI AutoPoll command failed");
		return -EIO;
	}

	LOG_DBG("MSPI read status reg MemRdy");
	return mspi_stm32_wait_auto_polling(dev,
		MSPI_STM32_MEM_RDY_MATCH,
		MSPI_STM32_MEM_RDY_MASK,
		HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
}

/* Enables writing to the memory sending a Write Enable and wait till it is effective */
static int mspi_stm32_write_enable(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;
	XSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);

	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_WREN;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_WREN;
		/* force 1-line InstructionMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
	}
	s_command.AddressMode = HAL_XSPI_ADDRESS_NONE;
	s_command.DataMode = HAL_XSPI_DATA_NONE;
	s_command.DummyCycles = 0U;

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI flash write enable cmd failed");
		return -EIO;
	}
	LOG_DBG("MSPI write enable");

	/* New command to Configure automatic polling mode to wait for write enabling */
	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_RDSR;
		s_command.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
		s_command.DataMode = HAL_XSPI_DATA_8_LINES;
		s_command.DummyCycles = (cfg_rate == MSPI_DATA_RATE_DUAL)
						? MSPI_STM32_DUMMY_REG_OCTAL_DTR
						: MSPI_STM32_DUMMY_REG_OCTAL;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_RDSR;
		/* force 1-line DataMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		s_command.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		s_command.DataMode = HAL_XSPI_DATA_1_LINE;
		s_command.DummyCycles = 0;
	}
	s_command.DataLength = (cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U;
	s_command.Address = 0U;

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI config auto polling cmd failed");
		return -EIO;
	}
	LOG_DBG("MSPI read status reg");

	return mspi_stm32_wait_auto_polling(dev,
		MSPI_STM32_WREN_MATCH,
		MSPI_STM32_WREN_MASK,
		HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
}

/* Writes Flash configuration register 2 with new dummy cycles */
static int mspi_stm32_write_cfg2reg_dummy(const struct device *dev, uint8_t cfg_mode,
					  uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;
	uint8_t transmit_data = MSPI_STM32_CR2_DUMMY_CYCLES_66MHZ;
	XSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);

	/* Initializes the writing of configuration register 2 */
	s_command.Instruction = (cfg_mode == MSPI_IO_MODE_SINGLE) ? MSPI_STM32_CMD_WR_CFGREG2
								  : MSPI_STM32_OCMD_WR_CFGREG2;
	s_command.Address = MSPI_STM32_REG2_ADDR3;
	s_command.DummyCycles = 0U;
	s_command.DataLength = (cfg_mode == MSPI_IO_MODE_SINGLE)
				       ? 1U
				       : ((cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U);

	if (stm32_xspi_is_memorymap(dev)) {
		int ret = mspi_stm32_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped access before writing cfg reg");
		return  -1;
		}
	}

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI transmit cmd");
		return -EIO;
	}

	if (HAL_XSPI_Transmit(&dev_data->hmspi.xspi, &transmit_data, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI transmit ");
		return -EIO;
	}

