zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32.c
#define STM32_SMPI_IRQ_HANDLER(index)								\
	static void mspi_stm32_irq_config_func_##index(void)					\
	{											\
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), mspi_stm32_isr,	\
			DEVICE_DT_INST_GET(index), 0);	\
		irq_enable(DT_INST_IRQN(index));	\
	}

#define MSPI_STM32_INIT(index)                                                              \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);	\
	PINCTRL_DT_INST_DEFINE(index);								\
	\
	static struct gpio_dt_spec ce_gpios##n[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(n);             \
	STM32_SMPI_IRQ_HANDLER(index)								\
	static const struct mspi_stm32_conf mspi_stm32_dev_conf_##index = {	\
		.pclken = pclken_##index,	\
		.pclk_len = DT_INST_NUM_CLOCKS(index),	\
		.irq_config =  mspi_stm32_irq_config_func_##index,				\
		.mspicfg = MSPI_CONFIG(index),	\
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(DT_DRV_INST(index)),	\
		.mspicfg.num_ce_gpios  = ARRAY_SIZE(ce_gpios##n),				\
		.use_dma = DT_NODE_HAS_PROP(DT_DRV_INST(index), dmas),	\
	};											\
	static struct mspi_stm32_data mspi_stm32_dev_data_##index = {                           \
		.hmspi.xspi = {                                                                          \
		.Instance = (XSPI_TypeDef *)DT_INST_REG_ADDR(index),                             \
		.Init = {                                                                        \
			.FifoThresholdByte = MSPI_STM32_FIFO_THRESHOLD,                              \
			.SampleShifting = (DT_INST_PROP(index, ssht_enable)                          \
					? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE                       \
					: HAL_XSPI_SAMPLE_SHIFT_NONE),                           \
			.ChipSelectHighTimeCycle = 1,                                                \
			.ClockMode = HAL_XSPI_CLOCK_MODE_0,                                          \
			.ChipSelectBoundary = 0,                                                     \
			.MemoryMode = HAL_XSPI_SINGLE_MEM,                                           \
			.MemorySize = 0x19,                                                          \
			.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE,                              \
		},                                                                               \
		},                                                                                   \
		.memmap_base_addr  = DT_REG_ADDR_BY_IDX(DT_DRV_INST(index), 1),	\
		.dev_id = index,                                                                     \
		.lock = Z_MUTEX_INITIALIZER(mspi_stm32_dev_data_##index.lock),                       \
		.sync = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.sync, 0, 1),                   \
		.dev_cfg = {0},                                                                      \
		.xip_cfg = {0},                                                                      \
		.ctx.lock = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.ctx.lock, 0, 1),           \
		XSPI_DMA_CHANNEL(DT_DRV_INST(index), tx, TX, MEMORY, PERIPHERAL)	\
		XSPI_DMA_CHANNEL(DT_DRV_INST(index), rx, RX, PERIPHERAL, MEMORY)	\
	};                                                                                       \
	\
	DEVICE_DT_INST_DEFINE(index, &mspi_stm32_init, NULL, &mspi_stm32_dev_data_##index,       \
				&mspi_stm32_dev_conf_##index, POST_KERNEL,                                 \
				CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &mspi_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSPI_STM32_INIT)
